// 1)
//Что такое Jquery?
// Jquery - это библиотека JavaScript 
// 2)
//В чем польза Jquery?
// Jquery упрощает использования JavaScript на сайте
// 3)
//Какие функции содержит в себе Jquery?
// html/dom манипуляция
// css манипуляция
// html методы событий
// Ajax
// Эффекты и анимации
// Утилиты

// 4)
//Какие известные компании используют Jquery?
// Google
// Microsoft
// IBM
// Netflix
// 5)
//Куда нужно подключать Jquery?
// в html
// 6)
//В какую папку нужно поместить скаченый Jquery?
// В папку  js где мы будем работать
// 7)
//Как лучше подключать Jquery?
// Через jQuery.com
// 8)
//Как выглядит базовый синтаксис Jquery?
// $('selector').action()
// 9)
//Что делает метод $(this).hide() ?
// делает так чтобы элемента не было видно
// 10)
//Что делает метод $("p").hide() ?
// делает так чтобы элемента p(тест и т.д) не было видно
// 11)
//Что делает метод $(".test").hide() ?
// делает так чтобы элемента с классом .test  не было видно

// 12)
//Что делает метод $("#test").hide() ?
// делает так чтобы элемента с id #test  не было видно
// 13)
//Пропиши ниже событие готовности верстки в Jquery
// $(document).ready(function(){})
// 14)
//Пропиши ниже событие готовности верстки в Jquery коротко
// $(function(){})
// 15)
//Для чего нужны селлекторы в Jquery?
// для таго чтобы выбрать или управлять HTML элементами
// 16)
//Догадайся что делает скрипт ниже
$(document).ready(() => {
    $('.button').click(() => {
        console.log('Hello')
    })
})

// при нажатии на кнопку в консоле выводиться Hello

// 17)
//Как в Jquery обратится к селлектору id?
// через $('#something')
// 18)
//Как в Jquery обратится к селлектору class?
// через $('.something')
// 19)
//Перечисли ниже все селлекторы Jquery которые есть, а не те которые помнишь!

// id,class, атрибут имя 